# Developer Tools
brew 'git'
brew 'bash-completion'
brew 'node'
brew 'yarn'
brew 'vim'
brew 'python'
brew 'zip'
brew "kubernetes-cli"
brew 'minikube'

# Developer Applications 
cask 'hyper'
cask 'visual-studio-code'
cask 'postman'
cask 'pycharm'
cask 'docker'


# Communication Applications
cask 'discord'
cask 'slack'
cask 'microsoft-outlook'

# Esstential Applications
cask 'google-chrome'
cask 'spotify'
cask 'karabiner-elements'

# Productivity Applications
cask 'raycast'
cask 'notion'
cask 'figma'

# Security
cask 'bitwarden'
